{"format":"layers-model","generatedBy":"keras v3.14.1","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.14.1","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":"float32","layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer","optional":false,"batchInputShape":[null,216,128]}},{"class_name":"Bidirectional","config":{"name":"bidirectional","trainable":true,"dtype":"float32","merge_mode":"concat","layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"forward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,128]}},"backward_layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"backward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,128]}}}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Bidirectional","config":{"name":"bidirectional_1","trainable":true,"dtype":"float32","merge_mode":"concat","layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"forward_lstm_1","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,256]}},"backward_layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"backward_lstm_1","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,256]}}}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_1","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null}},{"class_name":"LayerNormalization","config":{"name":"layer_normalization_2","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99}},{"class_name":"Dropout","config":{"name":"dropout_3","trainable":true,"dtype":"float32","rate":0.4,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":5,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}}],"build_input_shape":[null,216,128]}},"training_config":{"loss":"categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.0002500000118743628,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"batch_normalization/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization/moving_variance","shape":[128],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/kernel","shape":[128,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/kernel","shape":[128,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/kernel","shape":[256,256],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/kernel","shape":[256,256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"dense/kernel","shape":[64,128],"dtype":"float32"},{"name":"dense/bias","shape":[128],"dtype":"float32"},{"name":"dense_1/kernel","shape":[128,5],"dtype":"float32"},{"name":"dense_1/bias","shape":[5],"dtype":"float32"},{"name":"layer_normalization/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization/beta","shape":[256],"dtype":"float32"},{"name":"layer_normalization_1/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_1/beta","shape":[128],"dtype":"float32"},{"name":"layer_normalization_2/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_2/beta","shape":[64],"dtype":"float32"},{"name":"lstm_2/lstm_cell/kernel","shape":[128,256],"dtype":"float32"},{"name":"lstm_2/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_2/lstm_cell/bias","shape":[256],"dtype":"float32"}]}]}