{"format":"layers-model","generatedBy":"keras v3.14.1","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.14.1","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"CNN_LSTM_BabyCry","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"spectrogram_input","optional":false,"batchInputShape":[null,216,128,1]},"name":"spectrogram_input","inbound_nodes":[]},{"class_name":"Conv2D","config":{"name":"conv1a","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv1a","inbound_nodes":[[["spectrogram_input",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn1a","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"bn1a","inbound_nodes":[[["conv1a",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv1b","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv1b","inbound_nodes":[[["bn1a",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn1b","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"bn1b","inbound_nodes":[[["conv1b",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"pool1","trainable":true,"dtype":"float32","pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last"},"name":"pool1","inbound_nodes":[[["bn1b",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"drop1","trainable":true,"dtype":"float32","rate":0.25,"seed":null,"noise_shape":null},"name":"drop1","inbound_nodes":[[["pool1",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2a","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2a","inbound_nodes":[[["drop1",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn2a","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"bn2a","inbound_nodes":[[["conv2a",0,0,{}]]]},{"class_name":"Conv2D","config":{"name":"conv2b","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conv2b","inbound_nodes":[[["bn2a",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn2b","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"bn2b","inbound_nodes":[[["conv2b",0,0,{}]]]},{"class_name":"MaxPooling2D","config":{"name":"pool2","trainable":true,"dtype":"float32","pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last"},"name":"pool2","inbound_nodes":[[["bn2b",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"drop2","trainable":true,"dtype":"float32","rate":0.25,"seed":null,"noise_shape":null},"name":"drop2","inbound_nodes":[[["pool2",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"reshape_for_lstm","trainable":true,"dtype":"float32","target_shape":[216,2048]},"name":"reshape_for_lstm","inbound_nodes":[[["drop2",0,0,{}]]]},{"class_name":"Bidirectional","config":{"name":"bilstm1","trainable":true,"dtype":"float32","merge_mode":"concat","layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"forward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,2048]}},"backward_layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"backward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,2048]}}},"name":"bilstm1","inbound_nodes":[[["reshape_for_lstm",0,0,{}]]]},{"class_name":"LayerNormalization","config":{"name":"ln1","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"ln1","inbound_nodes":[[["bilstm1",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"drop3","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null},"name":"drop3","inbound_nodes":[[["ln1",0,0,{}]]]},{"class_name":"Bidirectional","config":{"name":"bilstm2","trainable":true,"dtype":"float32","merge_mode":"concat","layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"forward_lstm_1","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,256]}},"backward_layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"backward_lstm_1","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,216,256]}}},"name":"bilstm2","inbound_nodes":[[["drop3",0,0,{}]]]},{"class_name":"LayerNormalization","config":{"name":"ln2","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"ln2","inbound_nodes":[[["bilstm2",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"drop4","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null},"name":"drop4","inbound_nodes":[[["ln2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"fc1","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"fc1","inbound_nodes":[[["drop4",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn_fc","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false,"renorm":false,"renorm_clipping":null,"renorm_momentum":0.99},"name":"bn_fc","inbound_nodes":[[["fc1",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"drop5","trainable":true,"dtype":"float32","rate":0.4,"seed":null,"noise_shape":null},"name":"drop5","inbound_nodes":[[["bn_fc",0,0,{}]]]},{"class_name":"Dense","config":{"name":"output","trainable":true,"dtype":"float32","units":5,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"output","inbound_nodes":[[["drop5",0,0,{}]]]}],"input_layers":[["spectrogram_input",0,0]],"output_layers":[["output",0,0]]}},"training_config":{"loss":"categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":6.25000029685907e-05,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of3.bin","group1-shard2of3.bin","group1-shard3of3.bin"],"weights":[{"name":"forward_lstm/lstm_cell/kernel","shape":[2048,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/kernel","shape":[2048,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/kernel","shape":[256,256],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"forward_lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/kernel","shape":[256,256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"backward_lstm_1/lstm_cell/bias","shape":[256],"dtype":"float32"},{"name":"bn1a/gamma","shape":[32],"dtype":"float32"},{"name":"bn1a/beta","shape":[32],"dtype":"float32"},{"name":"bn1a/moving_mean","shape":[32],"dtype":"float32"},{"name":"bn1a/moving_variance","shape":[32],"dtype":"float32"},{"name":"bn1b/gamma","shape":[32],"dtype":"float32"},{"name":"bn1b/beta","shape":[32],"dtype":"float32"},{"name":"bn1b/moving_mean","shape":[32],"dtype":"float32"},{"name":"bn1b/moving_variance","shape":[32],"dtype":"float32"},{"name":"bn2a/gamma","shape":[64],"dtype":"float32"},{"name":"bn2a/beta","shape":[64],"dtype":"float32"},{"name":"bn2a/moving_mean","shape":[64],"dtype":"float32"},{"name":"bn2a/moving_variance","shape":[64],"dtype":"float32"},{"name":"bn2b/gamma","shape":[64],"dtype":"float32"},{"name":"bn2b/beta","shape":[64],"dtype":"float32"},{"name":"bn2b/moving_mean","shape":[64],"dtype":"float32"},{"name":"bn2b/moving_variance","shape":[64],"dtype":"float32"},{"name":"bn_fc/gamma","shape":[128],"dtype":"float32"},{"name":"bn_fc/beta","shape":[128],"dtype":"float32"},{"name":"bn_fc/moving_mean","shape":[128],"dtype":"float32"},{"name":"bn_fc/moving_variance","shape":[128],"dtype":"float32"},{"name":"conv1a/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv1a/bias","shape":[32],"dtype":"float32"},{"name":"conv1b/kernel","shape":[3,3,32,32],"dtype":"float32"},{"name":"conv1b/bias","shape":[32],"dtype":"float32"},{"name":"conv2a/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2a/bias","shape":[64],"dtype":"float32"},{"name":"conv2b/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"conv2b/bias","shape":[64],"dtype":"float32"},{"name":"fc1/kernel","shape":[128,128],"dtype":"float32"},{"name":"fc1/bias","shape":[128],"dtype":"float32"},{"name":"ln1/gamma","shape":[256],"dtype":"float32"},{"name":"ln1/beta","shape":[256],"dtype":"float32"},{"name":"ln2/gamma","shape":[128],"dtype":"float32"},{"name":"ln2/beta","shape":[128],"dtype":"float32"},{"name":"output/kernel","shape":[128,5],"dtype":"float32"},{"name":"output/bias","shape":[5],"dtype":"float32"}]}]}